//   Copyright (c) 2024 KANEDA Akihiro <taoist.aki@gmail.com>
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.

using System;
using System.Collections.Generic;
using System.Collections.Immutable;
using System.Linq;
using System.Text;
using FluentAssertions;
using RedPen.Net.Core.Model;
using RedPen.Net.Core.Tokenizer;
using Xunit;
using Xunit.Abstractions;

namespace RedPen.Net.Core.Inflection.Tests
{
    public class InflectionResolverTests
    {
        private readonly ITestOutputHelper output;

        public InflectionResolverTests(ITestOutputHelper output)
        {
            this.output = output;
        }

        /// <summary>
        /// 活用形Resolveのテスト。
        /// </summary>
        [Fact()]
        public void ResolveTest()
        {
            TokenElement token = new TokenElement(
                "笑わ",
                "ワラワ",
                "ワラワ",
                ImmutableList.Create("動詞", "自立"),
                "笑う",
                "五段・ワ行促音便",
                "未然形",
                ImmutableList.Create(new LineOffset(1, 0))
            );

            InflectionResolver.Resolve(token, "基本形").surface.Should().Be("笑う");
            InflectionResolver.Resolve(token, "未然形").surface.Should().Be("笑わ");
            InflectionResolver.Resolve(token, "未然ウ接続").surface.Should().Be("笑お");
            InflectionResolver.Resolve(token, "連用形").surface.Should().Be("笑い");
            InflectionResolver.Resolve(token, "連用タ接続").surface.Should().Be("笑っ");
            InflectionResolver.Resolve(token, "仮定形").surface.Should().Be("笑え");
            InflectionResolver.Resolve(token, "命令ｅ").surface.Should().Be("笑え");

            (bool success, string surface) result = InflectionResolver.Resolve(token, "存在しない活用形");
            result.success.Should().BeFalse();
        }

        [Theory]
        // 10_完了.csv
        // 現在時制
        [InlineData("001", "笑った", "動詞", "五段・ワ行促音便", "連用タ接続")]

        // 過去時制
        [InlineData("002", "笑いました", "動詞", "五段・ワ行促音便", "連用形")]

        // 13_推定.csv
        // 現在時制
        [InlineData("003", "笑うらしい", "動詞", "五段・ワ行促音便", "基本形")]
        [InlineData("004", "笑うらしかった", "動詞", "五段・ワ行促音便", "基本形")]

        // 過去時制
        [InlineData("005", "笑うらしいです", "動詞", "五段・ワ行促音便", "基本形")]
        [InlineData("006", "笑うらしかったです", "動詞", "五段・ワ行促音便", "基本形")]

        // 14_断定.csv
        // 現在時制
        //[InlineData("007", "笑いだ", "動詞", "五段・ワ行促音便", "名詞")]
        [InlineData("007", "笑いだ", "名詞", "", "")]
        //[InlineData("008", "笑いだった", "動詞", "五段・ワ行促音便", "名詞")]
        [InlineData("008", "笑いだった", "名詞", "", "")]
        //[InlineData("009", "笑いである", "動詞", "五段・ワ行促音便", "名詞")]
        [InlineData("009", "笑いである", "名詞", "", "")]
        //[InlineData("010", "笑いであった", "動詞", "五段・ワ行促音便", "名詞")]
        [InlineData("010", "笑いであった", "名詞", "", "")]

        // 過去時制
        //[InlineData("011", "笑いです", "動詞", "五段・ワ行促音便", "名詞")]
        [InlineData("011", "笑いです", "名詞", "", "")]
        //[InlineData("012", "笑いでした", "動詞", "五段・ワ行促音便", "名詞")]
        [InlineData("012", "笑いでした", "名詞", "", "")]
        //[InlineData("013", "笑いです", "動詞", "五段・ワ行促音便", "名詞")]
        [InlineData("013", "笑いです", "名詞", "", "")]
        //[InlineData("014", "笑いでした", "動詞", "五段・ワ行促音便", "名詞")]
        [InlineData("014", "笑いでした", "名詞", "", "")]

        // 3_受け身可能自発尊敬.csv
        // 現在時制
        [InlineData("015", "笑われる", "動詞", "五段・ワ行促音便", "未然形")]
        [InlineData("016", "笑われた", "動詞", "五段・ワ行促音便", "未然形")]

        // 過去時制
        [InlineData("017", "笑われます", "動詞", "五段・ワ行促音便", "未然形")]
        [InlineData("018", "笑われました", "動詞", "五段・ワ行促音便", "未然形")]

        // 4_使役.csv
        // 現在時制
        //[InlineData("019", "笑わせる", "動詞", "一段", "基本形")]
        [InlineData("019", "笑わせる", "動詞", "五段・ワ行促音便", "未然形")]
        [InlineData("020", "笑わせた", "動詞", "一段", "連用形")]

        // 過去時制
        [InlineData("021", "笑わせます", "動詞", "一段", "連用形")]
        [InlineData("022", "笑わせました", "動詞", "一段", "連用形")]

        // 5_打ち消し.csv
        // 現在時制
        [InlineData("023", "こない", "動詞", "カ変・クル", "未然形")]
        [InlineData("024", "こなかった", "動詞", "カ変・クル", "未然形")]
        [InlineData("027", "来ない", "動詞", "カ変・来ル", "未然形")]
        [InlineData("028", "来なかった", "動詞", "カ変・来ル", "未然形")]
        [InlineData("031", "しない", "動詞", "サ変・スル", "未然形")]
        [InlineData("032", "しなかった", "動詞", "サ変・スル", "未然形")]
        //[InlineData("035", "察しない", "動詞", "サ変・－スル", "未然形")]
        [InlineData("035", "察しない", "名詞", "", "")]
        //[InlineData("036", "察しなかった", "動詞", "サ変・－スル", "未然形")]
        [InlineData("036", "察しなかった", "名詞", "", "")]
        //[InlineData("039", "生じない", "動詞", "サ変・－ズル", "未然形")]
        [InlineData("039", "生じない", "動詞", "一段", "未然形")]
        //[InlineData("040", "生じなかった", "動詞", "サ変・－ズル", "未然形")]
        [InlineData("040", "生じなかった", "動詞", "一段", "未然形")]
        [InlineData("043", "受けない", "動詞", "一段", "未然形")]
        [InlineData("044", "受けなかった", "動詞", "一段", "未然形")]
        [InlineData("047", "呉れない", "動詞", "一段・クレル", "未然形")]
        [InlineData("048", "呉れなかった", "動詞", "一段・クレル", "未然形")]
        //[InlineData("051", "助けない", "動詞", "下二・カ行", "未然形")]
        [InlineData("051", "助けない", "動詞", "一段", "未然形")]
        //[InlineData("052", "助けなかった", "動詞", "下二・カ行", "未然形")]
        [InlineData("052", "助けなかった", "動詞", "一段", "未然形")]
        //[InlineData("055", "見上げない", "動詞", "下二・ガ行", "未然形")]
        [InlineData("055", "見上げない", "動詞", "一段", "未然形")]
        //[InlineData("056", "見上げなかった", "動詞", "下二・ガ行", "未然形")]
        [InlineData("056", "見上げなかった", "動詞", "一段", "未然形")]
        [InlineData("059", "いでない", "動詞", "下二・ダ行", "未然形")]
        [InlineData("060", "いでなかった", "動詞", "下二・ダ行", "未然形")]
        [InlineData("063", "憂へない", "動詞", "下二・ハ行", "未然形")]
        [InlineData("064", "憂へなかった", "動詞", "下二・ハ行", "未然形")]
        //[InlineData("067", "改めない", "動詞", "下二・マ行", "未然形")]
        [InlineData("067", "改めない", "動詞", "一段", "未然形")]
        //[InlineData("068", "改めなかった", "動詞", "下二・マ行", "未然形")]
        [InlineData("068", "改めなかった", "動詞", "一段", "未然形")]
        //[InlineData("071", "得ない", "動詞", "下二・得", "未然形")]
        [InlineData("071", "得ない", "動詞", "一段", "未然形")]
        //[InlineData("072", "得なかった", "動詞", "下二・得", "未然形")]
        [InlineData("072", "得なかった", "動詞", "一段", "未然形")]
        [InlineData("075", "防がない", "動詞", "五段・ガ行", "未然形")]
        [InlineData("076", "防がなかった", "動詞", "五段・ガ行", "未然形")]
        [InlineData("079", "履かない", "動詞", "五段・カ行イ音便", "未然形")]
        [InlineData("080", "履かなかった", "動詞", "五段・カ行イ音便", "未然形")]
        [InlineData("083", "行かない", "動詞", "五段・カ行促音便", "未然形")]
        [InlineData("084", "行かなかった", "動詞", "五段・カ行促音便", "未然形")]
        [InlineData("087", "過ぎ行かない", "動詞", "五段・カ行促音便ユク", "未然形")]
        [InlineData("088", "過ぎ行かなかった", "動詞", "五段・カ行促音便ユク", "未然形")]
        [InlineData("091", "冷やさない", "動詞", "五段・サ行", "未然形")]
        [InlineData("092", "冷やさなかった", "動詞", "五段・サ行", "未然形")]
        [InlineData("095", "打たない", "動詞", "五段・タ行", "未然形")]
        [InlineData("096", "打たなかった", "動詞", "五段・タ行", "未然形")]
        [InlineData("099", "死なない", "動詞", "五段・ナ行", "未然形")]
        [InlineData("100", "死ななかった", "動詞", "五段・ナ行", "未然形")]
        [InlineData("103", "呼ばない", "動詞", "五段・バ行", "未然形")]
        [InlineData("104", "呼ばなかった", "動詞", "五段・バ行", "未然形")]
        [InlineData("107", "取り込まない", "動詞", "五段・マ行", "未然形")]
        [InlineData("108", "取り込まなかった", "動詞", "五段・マ行", "未然形")]
        [InlineData("111", "見送らない", "動詞", "五段・ラ行", "未然形")]
        [InlineData("112", "見送らなかった", "動詞", "五段・ラ行", "未然形")]
        [InlineData("115", "下さらない", "動詞", "五段・ラ行特殊", "未然形")]
        [InlineData("116", "下さらなかった", "動詞", "五段・ラ行特殊", "未然形")]
        //[InlineData("119", "言わない", "動詞", "五段・ワ行ウ音便", "未然形")]
        [InlineData("119", "言わない", "動詞", "五段・ワ行促音便", "未然形")]
        //[InlineData("120", "言わなかった", "動詞", "五段・ワ行ウ音便", "未然形")]
        [InlineData("120", "言わなかった", "動詞", "五段・ワ行促音便", "未然形")]
        [InlineData("123", "笑わない", "動詞", "五段・ワ行促音便", "未然形")]
        [InlineData("124", "笑わなかった", "動詞", "五段・ワ行促音便", "未然形")]
        [InlineData("127", "天てらさない", "動詞", "四段・サ行", "未然形")]
        [InlineData("128", "天てらさなかった", "動詞", "四段・サ行", "未然形")]
        [InlineData("131", "群だたない", "動詞", "四段・タ行", "未然形")]
        [InlineData("132", "群だたなかった", "動詞", "四段・タ行", "未然形")]
        [InlineData("135", "思はない", "動詞", "四段・ハ行", "未然形")]
        [InlineData("136", "思はなかった", "動詞", "四段・ハ行", "未然形")]
        [InlineData("139", "たばない", "動詞", "四段・バ行", "未然形")]
        [InlineData("140", "たばなかった", "動詞", "四段・バ行", "未然形")]
        [InlineData("143", "恥ぢない", "動詞", "上二・ダ行", "未然形")]
        [InlineData("144", "恥ぢなかった", "動詞", "上二・ダ行", "未然形")]
        [InlineData("147", "憂ひない", "動詞", "上二・ハ行", "未然形")]
        [InlineData("148", "憂ひなかった", "動詞", "上二・ハ行", "未然形")]
        //[InlineData("151", "得ない", "動詞", "検証用追加1", "未然形")]
        [InlineData("151", "得ない", "動詞", "一段", "未然形")]
        //[InlineData("152", "得なかった", "動詞", "検証用追加1", "未然形")]
        [InlineData("152", "得なかった", "動詞", "一段", "未然形")]
        //[InlineData("155", "ない", "動詞", "検証用追加2", "未然形")]
        [InlineData("155", "ない", "形容詞", "形容詞・アウオ段", "基本形")]
        //[InlineData("156", "なかった", "動詞", "検証用追加2", "未然形")]
        [InlineData("156", "なかった", "形容詞", "形容詞・アウオ段", "連用タ接続")]

        // 過去時制
        [InlineData("025", "きません", "動詞", "カ変・クル", "連用形")]
        [InlineData("026", "きませんでした", "動詞", "カ変・クル", "連用形")]
        [InlineData("029", "来ません", "動詞", "カ変・来ル", "連用形")]
        [InlineData("030", "来ませんでした", "動詞", "カ変・来ル", "連用形")]
        [InlineData("033", "しません", "動詞", "サ変・スル", "連用形")]
        [InlineData("034", "しませんでした", "動詞", "サ変・スル", "連用形")]
        //[InlineData("037", "察しません", "動詞", "サ変・－スル", "連用形")]
        [InlineData("037", "察しません", "動詞", "五段・サ行", "連用形")]
        //[InlineData("038", "察しませんでした", "動詞", "サ変・－スル", "連用形")]
        [InlineData("038", "察しませんでした", "動詞", "五段・サ行", "連用形")]
        //[InlineData("041", "生じません", "動詞", "サ変・－ズル", "連用形")]
        [InlineData("041", "生じません", "動詞", "一段", "連用形")]
        //[InlineData("042", "生じませんでした", "動詞", "サ変・－ズル", "連用形")]
        [InlineData("042", "生じませんでした", "動詞", "一段", "連用形")]
        [InlineData("045", "受けません", "動詞", "一段", "連用形")]
        [InlineData("046", "受けませんでした", "動詞", "一段", "連用形")]
        [InlineData("049", "呉れません", "動詞", "一段・クレル", "連用形")]
        [InlineData("050", "呉れませんでした", "動詞", "一段・クレル", "連用形")]
        //[InlineData("053", "助けません", "動詞", "下二・カ行", "連用形")]
        [InlineData("053", "助けません", "動詞", "一段", "連用形")]
        //[InlineData("054", "助けませんでした", "動詞", "下二・カ行", "連用形")]
        [InlineData("054", "助けませんでした", "動詞", "一段", "連用形")]
        //[InlineData("057", "見上げません", "動詞", "下二・ガ行", "連用形")]
        [InlineData("057", "見上げません", "動詞", "一段", "連用形")]
        //[InlineData("058", "見上げませんでした", "動詞", "下二・ガ行", "連用形")]
        [InlineData("058", "見上げませんでした", "動詞", "一段", "連用形")]
        [InlineData("061", "いでません", "動詞", "下二・ダ行", "連用形")]
        [InlineData("062", "いでませんでした", "動詞", "下二・ダ行", "連用形")]
        [InlineData("065", "憂へません", "動詞", "下二・ハ行", "連用形")]
        [InlineData("066", "憂へませんでした", "動詞", "下二・ハ行", "連用形")]
        //[InlineData("069", "改めません", "動詞", "下二・マ行", "連用形")]
        [InlineData("069", "改めません", "動詞", "一段", "連用形")]
        //[InlineData("070", "改めませんでした", "動詞", "下二・マ行", "連用形")]
        [InlineData("070", "改めませんでした", "動詞", "一段", "連用形")]
        //[InlineData("073", "得ません", "動詞", "下二・得", "連用形")]
        [InlineData("073", "得ません", "動詞", "一段", "連用形")]
        //[InlineData("074", "得ませんでした", "動詞", "下二・得", "連用形")]
        [InlineData("074", "得ませんでした", "動詞", "一段", "連用形")]
        [InlineData("077", "防ぎません", "動詞", "五段・ガ行", "連用形")]
        [InlineData("078", "防ぎませんでした", "動詞", "五段・ガ行", "連用形")]
        [InlineData("081", "履きません", "動詞", "五段・カ行イ音便", "連用形")]
        [InlineData("082", "履きませんでした", "動詞", "五段・カ行イ音便", "連用形")]
        [InlineData("085", "行きません", "動詞", "五段・カ行促音便", "連用形")]
        [InlineData("086", "行きませんでした", "動詞", "五段・カ行促音便", "連用形")]
        [InlineData("089", "過ぎ行きません", "動詞", "五段・カ行促音便ユク", "連用形")]
        [InlineData("090", "過ぎ行きませんでした", "動詞", "五段・カ行促音便ユク", "連用形")]
        [InlineData("093", "冷やしません", "動詞", "五段・サ行", "連用形")]
        [InlineData("094", "冷やしませんでした", "動詞", "五段・サ行", "連用形")]
        [InlineData("097", "打ちません", "動詞", "五段・タ行", "連用形")]
        [InlineData("098", "打ちませんでした", "動詞", "五段・タ行", "連用形")]
        [InlineData("101", "死にません", "動詞", "五段・ナ行", "連用形")]
        [InlineData("102", "死にませんでした", "動詞", "五段・ナ行", "連用形")]
        [InlineData("105", "呼びません", "動詞", "五段・バ行", "連用形")]
        [InlineData("106", "呼びませんでした", "動詞", "五段・バ行", "連用形")]
        [InlineData("109", "取り込みません", "動詞", "五段・マ行", "連用形")]
        [InlineData("110", "取り込みませんでした", "動詞", "五段・マ行", "連用形")]
        [InlineData("113", "見送りません", "動詞", "五段・ラ行", "連用形")]
        [InlineData("114", "見送りませんでした", "動詞", "五段・ラ行", "連用形")]
        [InlineData("117", "下さいません", "動詞", "五段・ラ行特殊", "連用形")]
        [InlineData("118", "下さいませんでした", "動詞", "五段・ラ行特殊", "連用形")]
        //[InlineData("121", "言いません", "動詞", "五段・ワ行ウ音便", "連用形")]
        [InlineData("121", "言いません", "動詞", "五段・ワ行促音便", "連用形")]
        //[InlineData("122", "言いませんでした", "動詞", "五段・ワ行ウ音便", "連用形")]
        [InlineData("122", "言いませんでした", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("125", "笑いません", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("126", "笑いませんでした", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("129", "天てらしません", "動詞", "四段・サ行", "連用形")]
        [InlineData("130", "天てらしませんでした", "動詞", "四段・サ行", "連用形")]
        [InlineData("133", "群だちません", "動詞", "四段・タ行", "連用形")]
        [InlineData("134", "群だちませんでした", "動詞", "四段・タ行", "連用形")]
        [InlineData("137", "思ひません", "動詞", "四段・ハ行", "連用形")]
        [InlineData("138", "思ひませんでした", "動詞", "四段・ハ行", "連用形")]
        [InlineData("141", "たびません", "動詞", "四段・バ行", "連用形")]
        [InlineData("142", "たびませんでした", "動詞", "四段・バ行", "連用形")]
        [InlineData("145", "恥ぢません", "動詞", "上二・ダ行", "連用形")]
        [InlineData("146", "恥ぢませんでした", "動詞", "上二・ダ行", "連用形")]
        [InlineData("149", "憂ひません", "動詞", "上二・ハ行", "連用形")]
        [InlineData("150", "憂ひませんでした", "動詞", "上二・ハ行", "連用形")]
        //[InlineData("153", "得ません", "動詞", "検証用追加1", "連用形")]
        [InlineData("153", "得ません", "動詞", "一段", "連用形")]
        //[InlineData("154", "得ませんでした", "動詞", "検証用追加1", "連用形")]
        [InlineData("154", "得ませんでした", "動詞", "一段", "連用形")]
        //[InlineData("157", "ありません", "動詞", "検証用追加2", "連用形")]
        [InlineData("157", "ありません", "動詞", "五段・ラ行", "連用形")]
        //[InlineData("158", "ありませんでした", "動詞", "検証用追加2", "連用形")]
        [InlineData("158", "ありませんでした", "動詞", "五段・ラ行", "連用形")]

        // 6_意思推量.csv
        // 現在時制
        //[InlineData("159", "くる", "動詞", "カ変・クル", "基本形")]
        [InlineData("159", "くる", "動詞", "五段・ラ行", "基本形")]
        [InlineData("160", "こよう", "動詞", "カ変・クル", "未然ウ接続")]
        [InlineData("163", "来る", "動詞", "カ変・来ル", "基本形")]
        [InlineData("164", "来よう", "動詞", "カ変・来ル", "未然ウ接続")]
        //[InlineData("167", "する", "動詞", "サ変・スル", "基本形")]
        [InlineData("167", "する", "動詞", "五段・ラ行", "基本形")]
        //[InlineData("168", "しょう", "動詞", "サ変・－スル", "未然ウ接続")]
        [InlineData("168", "しょう", "動詞", "サ変・スル", "未然ウ接続")]
        //[InlineData("171", "察する", "動詞", "サ変・－スル", "基本形")]
        [InlineData("171", "察する", "動詞", "サ変・−スル", "基本形")]
        //[InlineData("172", "察しょう", "動詞", "サ変・－スル", "未然ウ接続")]
        [InlineData("172", "察しょう", "名詞", "", "")]
        //[InlineData("175", "生ずる", "動詞", "サ変・－ズル", "基本形")]
        [InlineData("175", "生ずる", "動詞", "サ変・−ズル", "基本形")]
        //[InlineData("176", "生ぜよう", "動詞", "サ変・－ズル", "未然ウ接続")]
        [InlineData("176", "生ぜよう", "動詞", "サ変・−ズル", "未然ウ接続")]
        [InlineData("179", "受ける", "動詞", "一段", "基本形")]
        [InlineData("180", "受けよう", "動詞", "一段", "未然ウ接続")]
        [InlineData("183", "呉れる", "動詞", "一段・クレル", "基本形")]
        [InlineData("184", "呉れよう", "動詞", "一段・クレル", "未然ウ接続")]
        //[InlineData("187", "いでる", "動詞", "下二・ダ行", "基本形")]
        [InlineData("187", "いでる", "動詞", "一段", "連用形")]
        //[InlineData("188", "いでよう", "動詞", "下二・ダ行", "未然ウ接続")]
        [InlineData("188", "いでよう", "動詞", "一段", "連用形")]
        //[InlineData("191", "憂へる", "動詞", "下二・ハ行", "基本形")]
        [InlineData("191", "憂へる", "動詞", "下二・ハ行", "連用形")]
        //[InlineData("192", "憂へよう", "動詞", "下二・ハ行", "未然ウ接続")]
        [InlineData("192", "憂へよう", "動詞", "下二・ハ行", "連用形")]
        [InlineData("195", "防ぐ", "動詞", "五段・ガ行", "基本形")]
        [InlineData("196", "防ごう", "動詞", "五段・ガ行", "未然ウ接続")]
        [InlineData("199", "履く", "動詞", "五段・カ行イ音便", "基本形")]
        [InlineData("200", "履こう", "動詞", "五段・カ行イ音便", "未然ウ接続")]
        [InlineData("203", "行く", "動詞", "五段・カ行促音便", "基本形")]
        [InlineData("204", "行こう", "動詞", "五段・カ行促音便", "未然ウ接続")]
        [InlineData("207", "過ぎ行く", "動詞", "五段・カ行促音便ユク", "基本形")]
        [InlineData("208", "過ぎ行こう", "動詞", "五段・カ行促音便ユク", "未然ウ接続")]
        [InlineData("211", "冷やす", "動詞", "五段・サ行", "基本形")]
        [InlineData("212", "冷やそう", "動詞", "五段・サ行", "未然ウ接続")]
        [InlineData("215", "打つ", "動詞", "五段・タ行", "基本形")]
        [InlineData("216", "打とう", "動詞", "五段・タ行", "未然ウ接続")]
        [InlineData("219", "死ぬ", "動詞", "五段・ナ行", "基本形")]
        [InlineData("220", "死のう", "動詞", "五段・ナ行", "未然ウ接続")]
        [InlineData("223", "呼ぶ", "動詞", "五段・バ行", "基本形")]
        [InlineData("224", "呼ぼう", "動詞", "五段・バ行", "未然ウ接続")]
        [InlineData("227", "取り込む", "動詞", "五段・マ行", "基本形")]
        [InlineData("228", "取り込もう", "動詞", "五段・マ行", "未然ウ接続")]
        [InlineData("231", "見送る", "動詞", "五段・ラ行", "基本形")]
        [InlineData("232", "見送ろう", "動詞", "五段・ラ行", "未然ウ接続")]
        [InlineData("235", "下さる", "動詞", "五段・ラ行特殊", "基本形")]
        [InlineData("236", "下さろう", "動詞", "五段・ラ行特殊", "未然ウ接続")]
        //[InlineData("239", "言う", "動詞", "五段・ワ行ウ音便", "基本形")]
        [InlineData("239", "言う", "動詞", "五段・ワ行促音便", "基本形")]
        //[InlineData("240", "言おう", "動詞", "五段・ワ行ウ音便", "未然ウ接続")]
        [InlineData("240", "言おう", "動詞", "五段・ワ行促音便", "未然ウ接続")]
        [InlineData("243", "笑う", "動詞", "五段・ワ行促音便", "基本形")]
        [InlineData("244", "笑おう", "動詞", "五段・ワ行促音便", "未然ウ接続")]
        [InlineData("247", "天てらす", "動詞", "四段・サ行", "基本形")]
        //[InlineData("248", "天てらそう", "動詞", "四段・サ行", "未然ウ接続")]
        [InlineData("248", "天てらそう", "名詞", "", "")]
        [InlineData("251", "群だつ", "動詞", "四段・タ行", "基本形")]
        [InlineData("254", "思ふ", "動詞", "四段・ハ行", "基本形")]
        [InlineData("257", "たぶ", "動詞", "四段・バ行", "基本形")]
        [InlineData("260", "恥づ", "動詞", "上二・ダ行", "基本形")]
        //[InlineData("263", "憂ふ", "動詞", "上二・ハ行", "基本形")]
        [InlineData("263", "憂ふ", "動詞", "下二・ハ行", "基本形")]
        [InlineData("266", "助ける", "動詞", "一段", "基本形")]
        [InlineData("267", "助けよう", "動詞", "一段", "未然ウ接続")]
        [InlineData("270", "見上げる", "動詞", "一段", "基本形")]
        [InlineData("271", "見上げよう", "動詞", "一段", "未然ウ接続")]
        [InlineData("274", "改める", "動詞", "一段", "基本形")]
        [InlineData("275", "改めよう", "動詞", "一段", "未然ウ接続")]
        [InlineData("278", "得る", "動詞", "一段", "基本形")]
        [InlineData("279", "得よう", "動詞", "一段", "未然ウ接続")]

        // 過去時制
        [InlineData("161", "きます", "動詞", "カ変・クル", "連用形")]
        [InlineData("162", "きましょう", "動詞", "カ変・クル", "連用形")]
        [InlineData("165", "来ます", "動詞", "カ変・来ル", "連用形")]
        [InlineData("166", "来ましょう", "動詞", "カ変・来ル", "連用形")]
        [InlineData("169", "します", "動詞", "サ変・スル", "連用形")]
        [InlineData("170", "しましょう", "動詞", "サ変・スル", "連用形")]
        //[InlineData("173", "察します", "動詞", "サ変・－スル", "連用形")]
        [InlineData("173", "察します", "動詞", "五段・サ行", "連用形")]
        //[InlineData("174", "察しましょう", "動詞", "サ変・－スル", "連用形")]
        [InlineData("174", "察しましょう", "動詞", "五段・サ行", "連用形")]
        //[InlineData("177", "生じます", "動詞", "サ変・－ズル", "連用形")]
        [InlineData("177", "生じます", "動詞", "一段", "連用形")]
        //[InlineData("178", "生じましょう", "動詞", "サ変・－ズル", "連用形")]
        [InlineData("178", "生じましょう", "動詞", "一段", "連用形")]
        [InlineData("181", "受けます", "動詞", "一段", "連用形")]
        [InlineData("182", "受けましょう", "動詞", "一段", "連用形")]
        [InlineData("185", "呉れます", "動詞", "一段・クレル", "連用形")]
        [InlineData("186", "呉れましょう", "動詞", "一段・クレル", "連用形")]
        [InlineData("189", "いでます", "動詞", "下二・ダ行", "連用形")]
        [InlineData("190", "いでましょう", "動詞", "下二・ダ行", "連用形")]
        [InlineData("193", "憂へます", "動詞", "下二・ハ行", "連用形")]
        [InlineData("194", "憂へましょう", "動詞", "下二・ハ行", "連用形")]
        [InlineData("197", "防ぎます", "動詞", "五段・ガ行", "連用形")]
        [InlineData("198", "防ぎましょう", "動詞", "五段・ガ行", "連用形")]
        [InlineData("201", "履きます", "動詞", "五段・カ行イ音便", "連用形")]
        [InlineData("202", "履きましょう", "動詞", "五段・カ行イ音便", "連用形")]
        [InlineData("205", "行きます", "動詞", "五段・カ行促音便", "連用形")]
        [InlineData("206", "行きましょう", "動詞", "五段・カ行促音便", "連用形")]
        [InlineData("209", "過ぎ行きます", "動詞", "五段・カ行促音便ユク", "連用形")]
        [InlineData("210", "過ぎ行きましょう", "動詞", "五段・カ行促音便ユク", "連用形")]
        [InlineData("213", "冷やします", "動詞", "五段・サ行", "連用形")]
        [InlineData("214", "冷やしましょう", "動詞", "五段・サ行", "連用形")]
        [InlineData("217", "打ちます", "動詞", "五段・タ行", "連用形")]
        [InlineData("218", "打ちましょう", "動詞", "五段・タ行", "連用形")]
        [InlineData("221", "死にます", "動詞", "五段・ナ行", "連用形")]
        [InlineData("222", "死にましょう", "動詞", "五段・ナ行", "連用形")]
        [InlineData("225", "呼びます", "動詞", "五段・バ行", "連用形")]
        [InlineData("226", "呼びましょう", "動詞", "五段・バ行", "連用形")]
        [InlineData("229", "取り込みます", "動詞", "五段・マ行", "連用形")]
        [InlineData("230", "取り込みましょう", "動詞", "五段・マ行", "連用形")]
        [InlineData("233", "見送ります", "動詞", "五段・ラ行", "連用形")]
        [InlineData("234", "見送りましょう", "動詞", "五段・ラ行", "連用形")]
        [InlineData("237", "下さいます", "動詞", "五段・ラ行特殊", "連用形")]
        [InlineData("238", "下さいましょう", "動詞", "五段・ラ行特殊", "連用形")]
        //[InlineData("241", "言います", "動詞", "五段・ワ行ウ音便", "連用形")]
        [InlineData("241", "言います", "動詞", "五段・ワ行促音便", "連用形")]
        //[InlineData("242", "言いましょう", "動詞", "五段・ワ行ウ音便", "連用形")]
        [InlineData("242", "言いましょう", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("245", "笑います", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("246", "笑いましょう", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("249", "天てらします", "動詞", "四段・サ行", "連用形")]
        [InlineData("250", "天てらしましょう", "動詞", "四段・サ行", "連用形")]
        [InlineData("252", "群だちます", "動詞", "四段・タ行", "連用形")]
        [InlineData("253", "群だちましょう", "動詞", "四段・タ行", "連用形")]
        [InlineData("255", "思ひます", "動詞", "四段・ハ行", "連用形")]
        [InlineData("256", "思ひましょう", "動詞", "四段・ハ行", "連用形")]
        [InlineData("258", "たびます", "動詞", "四段・バ行", "連用形")]
        [InlineData("259", "たびましょう", "動詞", "四段・バ行", "連用形")]
        [InlineData("261", "恥ぢます", "動詞", "上二・ダ行", "連用形")]
        [InlineData("262", "恥ぢましょう", "動詞", "上二・ダ行", "連用形")]
        [InlineData("264", "憂ひます", "動詞", "上二・ハ行", "連用形")]
        [InlineData("265", "憂ひましょう", "動詞", "上二・ハ行", "連用形")]
        [InlineData("268", "助けます", "動詞", "一段", "連用形")]
        [InlineData("269", "助けましょう", "動詞", "一段", "連用形")]
        [InlineData("272", "見上げます", "動詞", "一段", "連用形")]
        [InlineData("273", "見上げましょう", "動詞", "一段", "連用形")]
        [InlineData("276", "改めます", "動詞", "一段", "連用形")]
        [InlineData("277", "改めましょう", "動詞", "一段", "連用形")]
        [InlineData("280", "得ます", "動詞", "一段", "連用形")]
        [InlineData("281", "得ましょう", "動詞", "一段", "連用形")]

        // 8_希望.csv
        // 現在時制
        [InlineData("282", "笑いたい", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("283", "笑いたかった", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("284", "笑いたがる", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("285", "笑いたがった", "動詞", "五段・ワ行促音便", "連用形")]

        // 過去時制
        [InlineData("286", "笑いたいです", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("287", "笑いたかったです", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("288", "笑いたがります", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("289", "笑いたがりました", "動詞", "五段・ワ行促音便", "連用形")]

        // 可能.csv
        // 現在時制
        [InlineData("290", "笑える", "動詞", "一段", "基本形")]
        [InlineData("291", "笑えた", "動詞", "一段", "連用形")]

        // 過去時制
        [InlineData("292", "笑えます", "動詞", "一段", "連用形")]
        [InlineData("293", "笑えました", "動詞", "一段", "連用形")]

        // 命令.csv
        // 現在時制
        //[InlineData("294", "笑え", "動詞", "五段・ワ行促音便", "命令ｅ")]
        [InlineData("294", "笑え", "動詞", "一段", "連用形")]
        //[InlineData("295", "笑えよ", "動詞", "五段・ワ行促音便", "命令ｙｏ")]
        [InlineData("295", "笑えよ", "動詞", "五段・ワ行促音便", "命令ｅ")]

        // 過去時制
        [InlineData("296", "笑いなさい", "動詞", "五段・ワ行促音便", "連用形")]
        [InlineData("297", "笑いなさいよ", "動詞", "五段・ワ行促音便", "連用形")]
        public void 動詞用法のテスト(string nouse, string surface, string pos, string type, string form)
        {
            var tokenElements = KuromojiController.Tokenize(new Sentence(surface, 1));

            // Token目視
            output.WriteLine($"{tokenElements[0].ToString()}");
            output.WriteLine($"{tokenElements[0].ToGrammarRuleString()}"); // GrammerRuleも確認したい。

            tokenElements[0].PartOfSpeech[0].Should().Be(pos);
            tokenElements[0].InflectionType.Should().Be(type);
            tokenElements[0].InflectionForm.Should().Be(form);
        }

        /// <summary>
        /// 活用変化を目視確認するためのデータセットテストケース。
        /// </summary>
        [Fact]
        public void WatchTokenizedString()
        {
            string text = @"
笑わない
笑おう
笑う
笑いだ
笑いである
笑うとき
笑えば
笑え
笑えよ
笑われる
笑える
笑わせる
笑わさせる
笑わぬ
笑わん
笑おう
笑うまい
笑いたい
笑いたがる
笑いそうだ
笑うようだ
笑うらしい
笑っている
笑わなかった
笑った
笑いだった
笑いであった
笑ったとき
笑われた
笑えた
笑わせた
笑わさせた
笑いたかった
笑いたがった
笑いそうだった
笑うようだった
笑うらしかった
笑っていた
笑いません
笑いましょう
笑います
笑いです
笑いです
ｘ
ｘ
笑いなさい
笑いなさいよ
笑われます
笑えます
笑わせます
笑わさせます
笑いませぬ
笑いません
笑いましょう
笑いますまい
笑いたいです
笑いたがります
笑いそうです
笑うようです
笑うらしいです
笑っています
笑いませんでした
笑いました
笑いでした
笑いでした
ｘ
笑われました
笑えました
笑わせました
笑わさせました
笑いたかったです
笑いたがりました
笑いそうでした
笑うようでした
笑うらしかったです
笑っていました
";

            // 1行ごとにSentenceに変換する。
            var sentences = text.Split(
                new[] { "\r\n", "\r", "\n" },
                StringSplitOptions.None
            ).Select((item, index) => new Sentence(item, index));

            List<List<TokenElement>> listlist = sentences.Select(i => KuromojiController.Tokenize(i)).ToList();

            foreach (var tokens in listlist)
            {
                // 元の文
                StringBuilder sb = new StringBuilder();
                sb.Append(string.Join("", tokens.Select(i => i.Surface)));
                sb.Append('\t');

                // 品詞情報
                List<string> tokenString = new List<string>();
                foreach (var token in tokens)
                {
                    tokenString.Add($"{token.Surface}({token.Reading})/{token.BaseForm}[{token.PartOfSpeech[0]}]{token.InflectionType}/{token.InflectionForm}");
                }

                sb.Append(string.Join(" - ", tokenString));
                sb.Append('\t');

                // Surfaceのみの区切り表示
                sb.Append(string.Join(" - ", tokens.Select(i => i.Surface)));
                sb.Append('\t');

                // Surfaceのみの区切り表示の逆順（活用語尾で確認したいため）
                sb.Append(string.Join(" - ", tokens.Select(i => i.Surface).Reverse()));

                output.WriteLine(sb.ToString());
            }
        }
    }
}
