//   Copyright (c) 2024 KANEDA Akihiro <taoist.aki@gmail.com>
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.

using System;
using System.Collections.Generic;
using System.Collections.Immutable;
using System.Linq;
using System.Text;
using FluentAssertions;
using RedPen.Net.Core.Model;
using RedPen.Net.Core.Tokenizer;
using Xunit;
using Xunit.Abstractions;

namespace RedPen.Net.Core.Inflection.Tests
{
    public class InflectionResolverTests
    {
        private readonly ITestOutputHelper output;

        public InflectionResolverTests(ITestOutputHelper output)
        {
            this.output = output;
        }

        /// <summary>
        /// 活用形Resolveのテスト。
        /// </summary>
        [Fact()]
        public void ResolveTest()
        {
            TokenElement token = new TokenElement(
                "笑わ",
                "ワラワ",
                "ワラワ",
                ImmutableList.Create("動詞", "自立"),
                "笑う",
                "五段・ワ行促音便",
                "未然形",
                ImmutableList.Create(new LineOffset(1, 0))
            );

            InflectionResolver.Resolve(token, "基本形").surface.Should().Be("笑う");
            InflectionResolver.Resolve(token, "未然形").surface.Should().Be("笑わ");
            InflectionResolver.Resolve(token, "未然ウ接続").surface.Should().Be("笑お");
            InflectionResolver.Resolve(token, "連用形").surface.Should().Be("笑い");
            InflectionResolver.Resolve(token, "連用タ接続").surface.Should().Be("笑っ");
            InflectionResolver.Resolve(token, "仮定形").surface.Should().Be("笑え");
            InflectionResolver.Resolve(token, "命令ｅ").surface.Should().Be("笑え");

            (bool success, string surface) result = InflectionResolver.Resolve(token, "存在しない活用形");
            result.success.Should().BeFalse();
        }

        [Theory]
        // 10_完了.csv
        // 現在時制
        [InlineData("001", "五段・ワ行促音便", "笑った", "連用タ接続")]

        // 過去時制
        [InlineData("002", "五段・ワ行促音便", "笑いました", "連用形")]

        // 13_推定.csv
        // 現在時制
        [InlineData("003", "五段・ワ行促音便", "笑うらしい", "基本形")]
        [InlineData("004", "五段・ワ行促音便", "笑うらしかった", "基本形")]

        // 過去時制
        [InlineData("005", "五段・ワ行促音便", "笑うらしいです", "基本形")]
        [InlineData("006", "五段・ワ行促音便", "笑うらしかったです", "基本形")]

        // 14_断定.csv
        // 現在時制
        [InlineData("007", "五段・ワ行促音便", "笑いだ", "名詞")]
        [InlineData("008", "五段・ワ行促音便", "笑いだった", "名詞")]
        [InlineData("009", "五段・ワ行促音便", "笑いである", "名詞")]
        [InlineData("010", "五段・ワ行促音便", "笑いであった", "名詞")]

        // 過去時制
        [InlineData("011", "五段・ワ行促音便", "笑いです", "名詞")]
        [InlineData("012", "五段・ワ行促音便", "笑いでした", "名詞")]
        [InlineData("013", "五段・ワ行促音便", "笑いです", "名詞")]
        [InlineData("014", "五段・ワ行促音便", "笑いでした", "名詞")]

        // 3_受け身可能自発尊敬.csv
        // 現在時制
        [InlineData("015", "五段・ワ行促音便", "笑われる", "未然形")]
        [InlineData("016", "五段・ワ行促音便", "笑われた", "未然形")]

        // 過去時制
        [InlineData("017", "五段・ワ行促音便", "笑われます", "未然形")]
        [InlineData("018", "五段・ワ行促音便", "笑われました", "未然形")]

        // 4_使役.csv
        // 現在時制
        [InlineData("019", "一段", "笑わせる", "基本形")]
        [InlineData("020", "一段", "笑わせた", "連用形")]

        // 過去時制
        [InlineData("021", "一段", "笑わせます", "連用形")]
        [InlineData("022", "一段", "笑わせました", "連用形")]

        // 5_打ち消し.csv
        // 現在時制
        [InlineData("023", "カ変・クル", "こない", "未然形")]
        [InlineData("024", "カ変・クル", "こなかった", "未然形")]
        [InlineData("027", "カ変・来ル", "来ない", "未然形")]
        [InlineData("028", "カ変・来ル", "来なかった", "未然形")]
        [InlineData("031", "サ変・スル", "しない", "未然形")]
        [InlineData("032", "サ変・スル", "しなかった", "未然形")]
        [InlineData("035", "サ変・－スル", "察しない", "未然形")]
        [InlineData("036", "サ変・－スル", "察しなかった", "未然形")]
        [InlineData("039", "サ変・－ズル", "生じない", "未然形")]
        [InlineData("040", "サ変・－ズル", "生じなかった", "未然形")]
        [InlineData("043", "一段", "受けない", "未然形")]
        [InlineData("044", "一段", "受けなかった", "未然形")]
        [InlineData("047", "一段・クレル", "呉れない", "未然形")]
        [InlineData("048", "一段・クレル", "呉れなかった", "未然形")]
        [InlineData("051", "下二・カ行", "助けない", "未然形")]
        [InlineData("052", "下二・カ行", "助けなかった", "未然形")]
        [InlineData("055", "下二・ガ行", "見上げない", "未然形")]
        [InlineData("056", "下二・ガ行", "見上げなかった", "未然形")]
        [InlineData("059", "下二・ダ行", "いでない", "未然形")]
        [InlineData("060", "下二・ダ行", "いでなかった", "未然形")]
        [InlineData("063", "下二・ハ行", "憂へない", "未然形")]
        [InlineData("064", "下二・ハ行", "憂へなかった", "未然形")]
        [InlineData("067", "下二・マ行", "改めない", "未然形")]
        [InlineData("068", "下二・マ行", "改めなかった", "未然形")]
        [InlineData("071", "下二・得", "得ない", "未然形")]
        [InlineData("072", "下二・得", "得なかった", "未然形")]
        [InlineData("075", "五段・ガ行", "防がない", "未然形")]
        [InlineData("076", "五段・ガ行", "防がなかった", "未然形")]
        [InlineData("079", "五段・カ行イ音便", "履かない", "未然形")]
        [InlineData("080", "五段・カ行イ音便", "履かなかった", "未然形")]
        [InlineData("083", "五段・カ行促音便", "行かない", "未然形")]
        [InlineData("084", "五段・カ行促音便", "行かなかった", "未然形")]
        [InlineData("087", "五段・カ行促音便ユク", "過ぎ行かない", "未然形")]
        [InlineData("088", "五段・カ行促音便ユク", "過ぎ行かなかった", "未然形")]
        [InlineData("091", "五段・サ行", "冷やさない", "未然形")]
        [InlineData("092", "五段・サ行", "冷やさなかった", "未然形")]
        [InlineData("095", "五段・タ行", "打たない", "未然形")]
        [InlineData("096", "五段・タ行", "打たなかった", "未然形")]
        [InlineData("099", "五段・ナ行", "死なない", "未然形")]
        [InlineData("100", "五段・ナ行", "死ななかった", "未然形")]
        [InlineData("103", "五段・バ行", "呼ばない", "未然形")]
        [InlineData("104", "五段・バ行", "呼ばなかった", "未然形")]
        [InlineData("107", "五段・マ行", "取り込まない", "未然形")]
        [InlineData("108", "五段・マ行", "取り込まなかった", "未然形")]
        [InlineData("111", "五段・ラ行", "見送らない", "未然形")]
        [InlineData("112", "五段・ラ行", "見送らなかった", "未然形")]
        [InlineData("115", "五段・ラ行特殊", "下さらない", "未然形")]
        [InlineData("116", "五段・ラ行特殊", "下さらなかった", "未然形")]
        [InlineData("119", "五段・ワ行ウ音便", "言わない", "未然形")]
        [InlineData("120", "五段・ワ行ウ音便", "言わなかった", "未然形")]
        [InlineData("123", "五段・ワ行促音便", "笑わない", "未然形")]
        [InlineData("124", "五段・ワ行促音便", "笑わなかった", "未然形")]
        [InlineData("127", "四段・サ行", "天てらさない", "未然形")]
        [InlineData("128", "四段・サ行", "天てらさなかった", "未然形")]
        [InlineData("131", "四段・タ行", "群だたない", "未然形")]
        [InlineData("132", "四段・タ行", "群だたなかった", "未然形")]
        [InlineData("135", "四段・ハ行", "思はない", "未然形")]
        [InlineData("136", "四段・ハ行", "思はなかった", "未然形")]
        [InlineData("139", "四段・バ行", "たばない", "未然形")]
        [InlineData("140", "四段・バ行", "たばなかった", "未然形")]
        [InlineData("143", "上二・ダ行", "恥ぢない", "未然形")]
        [InlineData("144", "上二・ダ行", "恥ぢなかった", "未然形")]
        [InlineData("147", "上二・ハ行", "憂ひない", "未然形")]
        [InlineData("148", "上二・ハ行", "憂ひなかった", "未然形")]
        [InlineData("151", "検証用追加1", "得ない", "未然形")]
        [InlineData("152", "検証用追加1", "得なかった", "未然形")]
        [InlineData("155", "検証用追加2", "ない", "未然形")]
        [InlineData("156", "検証用追加2", "なかった", "未然形")]

        // 過去時制
        [InlineData("025", "カ変・クル", "きません", "連用形")]
        [InlineData("026", "カ変・クル", "きませんでした", "連用形")]
        [InlineData("029", "カ変・来ル", "来ません", "連用形")]
        [InlineData("030", "カ変・来ル", "来ませんでした", "連用形")]
        [InlineData("033", "サ変・スル", "しません", "連用形")]
        [InlineData("034", "サ変・スル", "しませんでした", "連用形")]
        [InlineData("037", "サ変・－スル", "察しません", "連用形")]
        [InlineData("038", "サ変・－スル", "察しませんでした", "連用形")]
        [InlineData("041", "サ変・－ズル", "生じません", "連用形")]
        [InlineData("042", "サ変・－ズル", "生じませんでした", "連用形")]
        [InlineData("045", "一段", "受けません", "連用形")]
        [InlineData("046", "一段", "受けませんでした", "連用形")]
        [InlineData("049", "一段・クレル", "呉れません", "連用形")]
        [InlineData("050", "一段・クレル", "呉れませんでした", "連用形")]
        [InlineData("053", "下二・カ行", "助けません", "連用形")]
        [InlineData("054", "下二・カ行", "助けませんでした", "連用形")]
        [InlineData("057", "下二・ガ行", "見上げません", "連用形")]
        [InlineData("058", "下二・ガ行", "見上げませんでした", "連用形")]
        [InlineData("061", "下二・ダ行", "いでません", "連用形")]
        [InlineData("062", "下二・ダ行", "いでませんでした", "連用形")]
        [InlineData("065", "下二・ハ行", "憂へません", "連用形")]
        [InlineData("066", "下二・ハ行", "憂へませんでした", "連用形")]
        [InlineData("069", "下二・マ行", "改めません", "連用形")]
        [InlineData("070", "下二・マ行", "改めませんでした", "連用形")]
        [InlineData("073", "下二・得", "得ません", "連用形")]
        [InlineData("074", "下二・得", "得ませんでした", "連用形")]
        [InlineData("077", "五段・ガ行", "防ぎません", "連用形")]
        [InlineData("078", "五段・ガ行", "防ぎませんでした", "連用形")]
        [InlineData("081", "五段・カ行イ音便", "履きません", "連用形")]
        [InlineData("082", "五段・カ行イ音便", "履きませんでした", "連用形")]
        [InlineData("085", "五段・カ行促音便", "行きません", "連用形")]
        [InlineData("086", "五段・カ行促音便", "行きませんでした", "連用形")]
        [InlineData("089", "五段・カ行促音便ユク", "過ぎ行きません", "連用形")]
        [InlineData("090", "五段・カ行促音便ユク", "過ぎ行きませんでした", "連用形")]
        [InlineData("093", "五段・サ行", "冷やしません", "連用形")]
        [InlineData("094", "五段・サ行", "冷やしませんでした", "連用形")]
        [InlineData("097", "五段・タ行", "打ちません", "連用形")]
        [InlineData("098", "五段・タ行", "打ちませんでした", "連用形")]
        [InlineData("101", "五段・ナ行", "死にません", "連用形")]
        [InlineData("102", "五段・ナ行", "死にませんでした", "連用形")]
        [InlineData("105", "五段・バ行", "呼びません", "連用形")]
        [InlineData("106", "五段・バ行", "呼びませんでした", "連用形")]
        [InlineData("109", "五段・マ行", "取り込みません", "連用形")]
        [InlineData("110", "五段・マ行", "取り込みませんでした", "連用形")]
        [InlineData("113", "五段・ラ行", "見送りません", "連用形")]
        [InlineData("114", "五段・ラ行", "見送りませんでした", "連用形")]
        [InlineData("117", "五段・ラ行特殊", "下さいません", "連用形")]
        [InlineData("118", "五段・ラ行特殊", "下さいませんでした", "連用形")]
        [InlineData("121", "五段・ワ行ウ音便", "言いません", "連用形")]
        [InlineData("122", "五段・ワ行ウ音便", "言いませんでした", "連用形")]
        [InlineData("125", "五段・ワ行促音便", "笑いません", "連用形")]
        [InlineData("126", "五段・ワ行促音便", "笑いませんでした", "連用形")]
        [InlineData("129", "四段・サ行", "天てらしません", "連用形")]
        [InlineData("130", "四段・サ行", "天てらしませんでした", "連用形")]
        [InlineData("133", "四段・タ行", "群だちません", "連用形")]
        [InlineData("134", "四段・タ行", "群だちませんでした", "連用形")]
        [InlineData("137", "四段・ハ行", "思ひません", "連用形")]
        [InlineData("138", "四段・ハ行", "思ひませんでした", "連用形")]
        [InlineData("141", "四段・バ行", "たびません", "連用形")]
        [InlineData("142", "四段・バ行", "たびませんでした", "連用形")]
        [InlineData("145", "上二・ダ行", "恥ぢません", "連用形")]
        [InlineData("146", "上二・ダ行", "恥ぢませんでした", "連用形")]
        [InlineData("149", "上二・ハ行", "憂ひません", "連用形")]
        [InlineData("150", "上二・ハ行", "憂ひませんでした", "連用形")]
        [InlineData("153", "検証用追加1", "得ません", "連用形")]
        [InlineData("154", "検証用追加1", "得ませんでした", "連用形")]
        [InlineData("157", "検証用追加2", "ありません", "連用形")]
        [InlineData("158", "検証用追加2", "ありませんでした", "連用形")]

        // 6_意思推量.csv
        // 現在時制
        [InlineData("159", "カ変・クル", "くる", "基本形")]
        [InlineData("160", "カ変・クル", "こよう", "未然ウ接続")]
        [InlineData("163", "カ変・来ル", "来る", "基本形")]
        [InlineData("164", "カ変・来ル", "来よう", "未然ウ接続")]
        [InlineData("167", "サ変・スル", "する", "基本形")]
        [InlineData("168", "サ変・スル", "しょう", "未然ウ接続")]
        [InlineData("171", "サ変・－スル", "察する", "基本形")]
        [InlineData("172", "サ変・－スル", "察しょう", "未然ウ接続")]
        [InlineData("175", "サ変・－ズル", "生ずる", "基本形")]
        [InlineData("176", "サ変・－ズル", "生ぜよう", "未然ウ接続")]
        [InlineData("179", "一段", "受ける", "基本形")]
        [InlineData("180", "一段", "受けよう", "未然ウ接続")]
        [InlineData("183", "一段・クレル", "呉れる", "基本形")]
        [InlineData("184", "一段・クレル", "呉れよう", "未然ウ接続")]
        [InlineData("187", "下二・ダ行", "いでる", "基本形")]
        [InlineData("188", "下二・ダ行", "いでよう", "未然ウ接続")]
        [InlineData("191", "下二・ハ行", "憂へる", "基本形")]
        [InlineData("192", "下二・ハ行", "憂へよう", "未然ウ接続")]
        [InlineData("195", "五段・ガ行", "防ぐ", "基本形")]
        [InlineData("196", "五段・ガ行", "防ごう", "未然ウ接続")]
        [InlineData("199", "五段・カ行イ音便", "履く", "基本形")]
        [InlineData("200", "五段・カ行イ音便", "履こう", "未然ウ接続")]
        [InlineData("203", "五段・カ行促音便", "行く", "基本形")]
        [InlineData("204", "五段・カ行促音便", "行こう", "未然ウ接続")]
        [InlineData("207", "五段・カ行促音便ユク", "過ぎ行く", "基本形")]
        [InlineData("208", "五段・カ行促音便ユク", "過ぎ行こう", "未然ウ接続")]
        [InlineData("211", "五段・サ行", "冷やす", "基本形")]
        [InlineData("212", "五段・サ行", "冷やそう", "未然ウ接続")]
        [InlineData("215", "五段・タ行", "打つ", "基本形")]
        [InlineData("216", "五段・タ行", "打とう", "未然ウ接続")]
        [InlineData("219", "五段・ナ行", "死ぬ", "基本形")]
        [InlineData("220", "五段・ナ行", "死のう", "未然ウ接続")]
        [InlineData("223", "五段・バ行", "呼ぶ", "基本形")]
        [InlineData("224", "五段・バ行", "呼ぼう", "未然ウ接続")]
        [InlineData("227", "五段・マ行", "取り込む", "基本形")]
        [InlineData("228", "五段・マ行", "取り込もう", "未然ウ接続")]
        [InlineData("231", "五段・ラ行", "見送る", "基本形")]
        [InlineData("232", "五段・ラ行", "見送ろう", "未然ウ接続")]
        [InlineData("235", "五段・ラ行特殊", "下さる", "基本形")]
        [InlineData("236", "五段・ラ行特殊", "下さろう", "未然ウ接続")]
        [InlineData("239", "五段・ワ行ウ音便", "言う", "基本形")]
        [InlineData("240", "五段・ワ行ウ音便", "言おう", "未然ウ接続")]
        [InlineData("243", "五段・ワ行促音便", "笑う", "基本形")]
        [InlineData("244", "五段・ワ行促音便", "笑おう", "未然ウ接続")]
        [InlineData("247", "四段・サ行", "天てらす", "基本形")]
        [InlineData("248", "四段・サ行", "天てらそう", "未然ウ接続")]
        [InlineData("251", "四段・タ行", "群だつ", "基本形")]
        [InlineData("254", "四段・ハ行", "思ふ", "基本形")]
        [InlineData("257", "四段・バ行", "たぶ", "基本形")]
        [InlineData("260", "上二・ダ行", "恥づ", "基本形")]
        [InlineData("263", "上二・ハ行", "憂ふ", "基本形")]
        [InlineData("266", "一段", "助ける", "基本形")]
        [InlineData("267", "一段", "助けよう", "未然ウ接続")]
        [InlineData("270", "一段", "見上げる", "基本形")]
        [InlineData("271", "一段", "見上げよう", "未然ウ接続")]
        [InlineData("274", "一段", "改める", "基本形")]
        [InlineData("275", "一段", "改めよう", "未然ウ接続")]
        [InlineData("278", "一段", "得る", "基本形")]
        [InlineData("279", "一段", "得よう", "未然ウ接続")]

        // 過去時制
        [InlineData("161", "カ変・クル", "きます", "連用形")]
        [InlineData("162", "カ変・クル", "きましょう", "連用形")]
        [InlineData("165", "カ変・来ル", "来ます", "連用形")]
        [InlineData("166", "カ変・来ル", "来ましょう", "連用形")]
        [InlineData("169", "サ変・スル", "します", "連用形")]
        [InlineData("170", "サ変・スル", "しましょう", "連用形")]
        [InlineData("173", "サ変・－スル", "察します", "連用形")]
        [InlineData("174", "サ変・－スル", "察しましょう", "連用形")]
        [InlineData("177", "サ変・－ズル", "生じます", "連用形")]
        [InlineData("178", "サ変・－ズル", "生じましょう", "連用形")]
        [InlineData("181", "一段", "受けます", "連用形")]
        [InlineData("182", "一段", "受けましょう", "連用形")]
        [InlineData("185", "一段・クレル", "呉れます", "連用形")]
        [InlineData("186", "一段・クレル", "呉れましょう", "連用形")]
        [InlineData("189", "下二・ダ行", "いでます", "連用形")]
        [InlineData("190", "下二・ダ行", "いでましょう", "連用形")]
        [InlineData("193", "下二・ハ行", "憂へます", "連用形")]
        [InlineData("194", "下二・ハ行", "憂へましょう", "連用形")]
        [InlineData("197", "五段・ガ行", "防ぎます", "連用形")]
        [InlineData("198", "五段・ガ行", "防ぎましょう", "連用形")]
        [InlineData("201", "五段・カ行イ音便", "履きます", "連用形")]
        [InlineData("202", "五段・カ行イ音便", "履きましょう", "連用形")]
        [InlineData("205", "五段・カ行促音便", "行きます", "連用形")]
        [InlineData("206", "五段・カ行促音便", "行きましょう", "連用形")]
        [InlineData("209", "五段・カ行促音便ユク", "過ぎ行きます", "連用形")]
        [InlineData("210", "五段・カ行促音便ユク", "過ぎ行きましょう", "連用形")]
        [InlineData("213", "五段・サ行", "冷やします", "連用形")]
        [InlineData("214", "五段・サ行", "冷やしましょう", "連用形")]
        [InlineData("217", "五段・タ行", "打ちます", "連用形")]
        [InlineData("218", "五段・タ行", "打ちましょう", "連用形")]
        [InlineData("221", "五段・ナ行", "死にます", "連用形")]
        [InlineData("222", "五段・ナ行", "死にましょう", "連用形")]
        [InlineData("225", "五段・バ行", "呼びます", "連用形")]
        [InlineData("226", "五段・バ行", "呼びましょう", "連用形")]
        [InlineData("229", "五段・マ行", "取り込みます", "連用形")]
        [InlineData("230", "五段・マ行", "取り込みましょう", "連用形")]
        [InlineData("233", "五段・ラ行", "見送ります", "連用形")]
        [InlineData("234", "五段・ラ行", "見送りましょう", "連用形")]
        [InlineData("237", "五段・ラ行特殊", "下さいます", "連用形")]
        [InlineData("238", "五段・ラ行特殊", "下さいましょう", "連用形")]
        [InlineData("241", "五段・ワ行ウ音便", "言います", "連用形")]
        [InlineData("242", "五段・ワ行ウ音便", "言いましょう", "連用形")]
        [InlineData("245", "五段・ワ行促音便", "笑います", "連用形")]
        [InlineData("246", "五段・ワ行促音便", "笑いましょう", "連用形")]
        [InlineData("249", "四段・サ行", "天てらします", "連用形")]
        [InlineData("250", "四段・サ行", "天てらしましょう", "連用形")]
        [InlineData("252", "四段・タ行", "群だちます", "連用形")]
        [InlineData("253", "四段・タ行", "群だちましょう", "連用形")]
        [InlineData("255", "四段・ハ行", "思ひます", "連用形")]
        [InlineData("256", "四段・ハ行", "思ひましょう", "連用形")]
        [InlineData("258", "四段・バ行", "たびます", "連用形")]
        [InlineData("259", "四段・バ行", "たびましょう", "連用形")]
        [InlineData("261", "上二・ダ行", "恥ぢます", "連用形")]
        [InlineData("262", "上二・ダ行", "恥ぢましょう", "連用形")]
        [InlineData("264", "上二・ハ行", "憂ひます", "連用形")]
        [InlineData("265", "上二・ハ行", "憂ひましょう", "連用形")]
        [InlineData("268", "一段", "助けます", "連用形")]
        [InlineData("269", "一段", "助けましょう", "連用形")]
        [InlineData("272", "一段", "見上げます", "連用形")]
        [InlineData("273", "一段", "見上げましょう", "連用形")]
        [InlineData("276", "一段", "改めます", "連用形")]
        [InlineData("277", "一段", "改めましょう", "連用形")]
        [InlineData("280", "一段", "得ます", "連用形")]
        [InlineData("281", "一段", "得ましょう", "連用形")]

        // 8_希望.csv
        // 現在時制
        [InlineData("282", "五段・ワ行促音便", "笑いたい", "連用形")]
        [InlineData("283", "五段・ワ行促音便", "笑いたかった", "連用形")]
        [InlineData("284", "五段・ワ行促音便", "笑いたがる", "連用形")]
        [InlineData("285", "五段・ワ行促音便", "笑いたがった", "連用形")]

        // 過去時制
        [InlineData("286", "五段・ワ行促音便", "笑いたいです", "連用形")]
        [InlineData("287", "五段・ワ行促音便", "笑いたかったです", "連用形")]
        [InlineData("288", "五段・ワ行促音便", "笑いたがります", "連用形")]
        [InlineData("289", "五段・ワ行促音便", "笑いたがりました", "連用形")]

        // 可能.csv
        // 現在時制
        [InlineData("290", "一段", "笑える", "基本形")]
        [InlineData("291", "一段", "笑えた", "連用形")]

        // 過去時制
        [InlineData("292", "一段", "笑えます", "連用形")]
        [InlineData("293", "一段", "笑えました", "連用形")]

        // 命令.csv
        // 現在時制
        [InlineData("294", "五段・ワ行促音便", "笑え", "命令ｅ")]
        [InlineData("295", "五段・ワ行促音便", "笑えよ", "命令ｙｏ")]

        // 過去時制
        [InlineData("296", "五段・ワ行促音便", "笑いなさい", "連用形")]
        [InlineData("297", "五段・ワ行促音便", "笑いなさいよ", "連用形")]
        public void 動詞打ち消し用法のテスト2(string nouse, string type, string surface, string form)
        {
            var tokenElements = KuromojiController.Tokenize(new Sentence(surface, 1));

            output.WriteLine($"{tokenElements[0].ToString()}");

            tokenElements[0].InflectionType.Should().Be(type);
            tokenElements[0].InflectionForm.Should().Be(form);
        }

        /// <summary>
        /// 打ち消し用法の動詞活用の検証コード
        /// NOTE: 出力を1つのテストケースでしたいためactualをリスト形式で。
        /// </summary>
        [Fact()]
        public void 動詞打ち消し用法のテスト()
        {
            List<(string type, string surface, string form)> actual = new List<(string type, string surface, string form)>()
            {
                 // 5_打ち消し.csv
                 // 現在時制
                 ("カ変・クル", "こない", "未然形"),
                 ("カ変・クル", "こなかった", "未然形"),
                 ("カ変・来ル", "来ない", "未然形"),
                 ("カ変・来ル", "来なかった", "未然形"),
                 ("サ変・スル", "しない", "未然形"),
                 ("サ変・スル", "しなかった", "未然形"),
                 // TokenElement { Surface = "察", Reading = "サッ(サッ)", PoS = [ 名詞-サ変接続 ], BaseForm = , Inflection = / OffsetMap = (L1,0)}
                 //("サ変・－スル", "察しない", "未然形"),
                 //("サ変・－スル", "察しなかった", "未然形"),
                 // TokenElement { Surface = "生じ", Reading = "ショウジ(ショージ)", PoS = [ 動詞-自立 ], BaseForm = 生じる, Inflection = 一段/未然形 OffsetMap = (L1,0)-(L1,1)}
                 //("サ変・－ズル", "生じない", "未然形"),
                 //("サ変・－ズル", "生じなかった", "未然形"),
                 ("一段", "受けない", "未然形"),
                 ("一段", "受けなかった", "未然形"),
                 ("一段・クレル", "呉れない", "未然形"),
                 ("一段・クレル", "呉れなかった", "未然形"),
                 // TokenElement { Surface = "助け", Reading = "タスケ(タスケ)", PoS = [ 動詞-自立 ], BaseForm = 助ける, Inflection = 一段/未然形 OffsetMap = (L1,0)-(L1,1)}
                 //("下二・カ行", "助けない", "未然形"),
                 //("下二・カ行", "助けなかった", "未然形"),
                 // TokenElement { Surface = "見上げ", Reading = "ミアゲ(ミアゲ)", PoS = [ 動詞-自立 ], BaseForm = 見上げる, Inflection = 一段/未然形 OffsetMap = (L1,0)-(L1,1)-(L1,2)}
                 //("下二・ガ行", "見上げない", "未然形"),
                 //("下二・ガ行", "見上げなかった", "未然形"),
                 ("下二・ダ行", "いでない", "未然形"),
                 ("下二・ダ行", "いでなかった", "未然形"),
                 ("下二・ハ行", "憂へない", "未然形"),
                 ("下二・ハ行", "憂へなかった", "未然形"),
                 // TokenElement { Surface = "改め", Reading = "アラタメ(アラタメ)", PoS = [ 動詞-自立 ], BaseForm = 改める, Inflection = 一段/未然形 OffsetMap = (L1,0)-(L1,1)}
                 //("下二・マ行", "改めない", "未然形"),
                 //("下二・マ行", "改めなかった", "未然形"),
                 // TokenElement { Surface = "得", Reading = "エ(エ)", PoS = [ 動詞-自立 ], BaseForm = 得る, Inflection = 一段/未然形 OffsetMap = (L1,0)}
                 //("下二・得", "得ない", "未然形"),
                 //("下二・得", "得なかった", "未然形"),
                 ("五段・ガ行", "防がない", "未然形"),
                 ("五段・ガ行", "防がなかった", "未然形"),
                 ("五段・カ行イ音便", "履かない", "未然形"),
                 ("五段・カ行イ音便", "履かなかった", "未然形"),
                 ("五段・カ行促音便", "行かない", "未然形"),
                 ("五段・カ行促音便", "行かなかった", "未然形"),
                 ("五段・カ行促音便ユク", "過ぎ行かない", "未然形"),
                 ("五段・カ行促音便ユク", "過ぎ行かなかった", "未然形"),
                 ("五段・サ行", "冷やさない", "未然形"),
                 ("五段・サ行", "冷やさなかった", "未然形"),
                 ("五段・タ行", "打たない", "未然形"),
                 ("五段・タ行", "打たなかった", "未然形"),
                 ("五段・ナ行", "死なない", "未然形"),
                 ("五段・ナ行", "死ななかった", "未然形"),
                 ("五段・バ行", "呼ばない", "未然形"),
                 ("五段・バ行", "呼ばなかった", "未然形"),
                 ("五段・マ行", "取り込まない", "未然形"),
                 ("五段・マ行", "取り込まなかった", "未然形"),
                 ("五段・ラ行", "見送らない", "未然形"),
                 ("五段・ラ行", "見送らなかった", "未然形"),
                 ("五段・ラ行特殊", "下さらない", "未然形"),
                 ("五段・ラ行特殊", "下さらなかった", "未然形"),
                 // TokenElement { Surface = "言わ", Reading = "イワ(イワ)", PoS = [ 動詞-自立 ], BaseForm = 言う, Inflection = 五段・ワ行促音便/未然形 OffsetMap = (L1,0)-(L1,1)}
                 //("五段・ワ行ウ音便", "言わない", "未然形"),
                 //("五段・ワ行ウ音便", "言わなかった", "未然形"),
                 ("五段・ワ行促音便", "笑わない", "未然形"),
                 ("五段・ワ行促音便", "笑わなかった", "未然形"),
                 ("四段・サ行", "天てらさない", "未然形"),
                 ("四段・サ行", "天てらさなかった", "未然形"),
                 ("四段・タ行", "群だたない", "未然形"),
                 ("四段・タ行", "群だたなかった", "未然形"),
                 ("四段・ハ行", "思はない", "未然形"),
                 ("四段・ハ行", "思はなかった", "未然形"),
                 ("四段・バ行", "たばない", "未然形"),
                 ("四段・バ行", "たばなかった", "未然形"),
                 ("上二・ダ行", "恥ぢない", "未然形"),
                 ("上二・ダ行", "恥ぢなかった", "未然形"),
                 ("上二・ハ行", "憂ひない", "未然形"),
                 ("上二・ハ行", "憂ひなかった", "未然形"),
                 // 検証用追加1→一段/未然形 OffsetMap = (L1,0)}
                 ("一段", "得ない", "未然形"),
                 ("一段", "得なかった", "未然形"),
                 // TokenElement { Surface = "ない", Reading = "ナイ(ナイ)", PoS = [ 形容詞-自立 ], BaseForm = , Inflection = 形容詞・アウオ段/基本形 OffsetMap = (L1,0)-(L1,1)}
                 //("検証用追加2", "ない", "未然形"),
                 // TokenElement { Surface = "なかっ", Reading = "ナカッ(ナカッ)", PoS = [ 形容詞-自立 ], BaseForm = ない, Inflection = 形容詞・アウオ段/連用タ接続 OffsetMap = (L1,0)-(L1,1)-(L1,2)}
                 //("検証用追加2", "なかった", "未然形"),

                 // 過去時制
                 ("カ変・クル", "きません", "連用形"),
                 ("カ変・クル", "きませんでした", "連用形"),
                 ("カ変・来ル", "来ません", "連用形"),
                 ("カ変・来ル", "来ませんでした", "連用形"),
                 ("サ変・スル", "しません", "連用形"),
                 ("サ変・スル", "しませんでした", "連用形"),
                 // TokenElement { Surface = "察し", Reading = "サッシ(サッシ)", PoS = [ 動詞-自立 ], BaseForm = 察す, Inflection = 五段・サ行/連用形 OffsetMap = (L1,0)-(L1,1)}
                 //("サ変・－スル", "察しません", "連用形"),
                 //("サ変・－スル", "察しませんでした", "連用形"),
                 // TokenElement { Surface = "生じ", Reading = "ショウジ(ショージ)", PoS = [ 動詞-自立 ], BaseForm = 生じる, Inflection = 一段/連用形 OffsetMap = (L1,0)-(L1,1)}
                 //("サ変・－ズル", "生じません", "連用形"),
                 //("サ変・－ズル", "生じませんでした", "連用形"),
                 ("一段", "受けません", "連用形"),
                 ("一段", "受けませんでした", "連用形"),
                 ("一段・クレル", "呉れません", "連用形"),
                 ("一段・クレル", "呉れませんでした", "連用形"),
                 // TokenElement { Surface = "助け", Reading = "タスケ(タスケ)", PoS = [ 動詞-自立 ], BaseForm = 助ける, Inflection = 一段/連用形 OffsetMap = (L1,0)-(L1,1)}
                 //("下二・カ行", "助けません", "連用形"),
                 //("下二・カ行", "助けませんでした", "連用形"),
                 // TokenElement { Surface = "見上げ", Reading = "ミアゲ(ミアゲ)", PoS = [ 動詞-自立 ], BaseForm = 見上げる, Inflection = 一段/連用形 OffsetMap = (L1,0)-(L1,1)-(L1,2)}
                 //("下二・ガ行", "見上げません", "連用形"),
                 //("下二・ガ行", "見上げませんでした", "連用形"),
                 ("下二・ダ行", "いでません", "連用形"),
                 ("下二・ダ行", "いでませんでした", "連用形"),
                 ("下二・ハ行", "憂へません", "連用形"),
                 ("下二・ハ行", "憂へませんでした", "連用形"),
                 // TokenElement { Surface = "改め", Reading = "アラタメ(アラタメ)", PoS = [ 動詞-自立 ], BaseForm = 改める, Inflection = 一段/連用形 OffsetMap = (L1,0)-(L1,1)}
                 //("下二・マ行", "改めません", "連用形"),
                 //("下二・マ行", "改めませんでした", "連用形"),
                 // TokenElement { Surface = "得", Reading = "エ(エ)", PoS = [ 動詞-自立 ], BaseForm = 得る, Inflection = 一段/連用形 OffsetMap = (L1,0)}
                 //("下二・得", "得ません", "連用形"),
                 //("下二・得", "得ませんでした", "連用形"),
                 ("五段・ガ行", "防ぎません", "連用形"),
                 ("五段・ガ行", "防ぎませんでした", "連用形"),
                 ("五段・カ行イ音便", "履きません", "連用形"),
                 ("五段・カ行イ音便", "履きませんでした", "連用形"),
                 ("五段・カ行促音便", "行きません", "連用形"),
                 ("五段・カ行促音便", "行きませんでした", "連用形"),
                 ("五段・カ行促音便ユク", "過ぎ行きません", "連用形"),
                 ("五段・カ行促音便ユク", "過ぎ行きませんでした", "連用形"),
                 ("五段・サ行", "冷やしません", "連用形"),
                 ("五段・サ行", "冷やしませんでした", "連用形"),
                 ("五段・タ行", "打ちません", "連用形"),
                 ("五段・タ行", "打ちませんでした", "連用形"),
                 ("五段・ナ行", "死にません", "連用形"),
                 ("五段・ナ行", "死にませんでした", "連用形"),
                 ("五段・バ行", "呼びません", "連用形"),
                 ("五段・バ行", "呼びませんでした", "連用形"),
                 ("五段・マ行", "取り込みません", "連用形"),
                 ("五段・マ行", "取り込みませんでした", "連用形"),
                 ("五段・ラ行", "見送りません", "連用形"),
                 ("五段・ラ行", "見送りませんでした", "連用形"),
                 ("五段・ラ行特殊", "下さいません", "連用形"),
                 ("五段・ラ行特殊", "下さいませんでした", "連用形"),
                 // TokenElement { Surface = "言い", Reading = "イイ(イイ)", PoS = [ 動詞-自立 ], BaseForm = 言う, Inflection = 五段・ワ行促音便/連用形 OffsetMap = (L1,0)-(L1,1)}
                 //("五段・ワ行ウ音便", "言いません", "連用形"),
                 //("五段・ワ行ウ音便", "言いませんでした", "連用形"),
                 ("五段・ワ行促音便", "笑いません", "連用形"),
                 ("五段・ワ行促音便", "笑いませんでした", "連用形"),
                 ("四段・サ行", "天てらしません", "連用形"),
                 ("四段・サ行", "天てらしませんでした", "連用形"),
                 ("四段・タ行", "群だちません", "連用形"),
                 ("四段・タ行", "群だちませんでした", "連用形"),
                 ("四段・ハ行", "思ひません", "連用形"),
                 ("四段・ハ行", "思ひませんでした", "連用形"),
                 ("四段・バ行", "たびません", "連用形"),
                 ("四段・バ行", "たびませんでした", "連用形"),
                 ("上二・ダ行", "恥ぢません", "連用形"),
                 ("上二・ダ行", "恥ぢませんでした", "連用形"),
                 ("上二・ハ行", "憂ひません", "連用形"),
                 ("上二・ハ行", "憂ひませんでした", "連用形"),
                 // 検証用追加1→一段
                 ("一段", "得ません", "連用形"),
                 ("一段", "得ませんでした", "連用形"),
                 // 検証用追加2→五段・ラ行
                 ("五段・ラ行", "ありません", "連用形"),
                 ("五段・ラ行", "ありませんでした", "連用形"),
            };

            foreach (var item in actual)
            {
                var tokenElements = KuromojiController.Tokenize(new Sentence(item.surface, 1));

                output.WriteLine($"{tokenElements[0].ToString()}");

                tokenElements[0].InflectionType.Should().Be(item.type);
                tokenElements[0].InflectionForm.Should().Be(item.form);
            }
        }

        /// <summary>
        /// 活用変化を目視確認するためのデータセットテストケース。
        /// </summary>
        [Fact]
        public void WatchTokenizedString()
        {
            string text = @"
笑わない
笑おう
笑う
笑いだ
笑いである
笑うとき
笑えば
笑え
笑えよ
笑われる
笑える
笑わせる
笑わさせる
笑わぬ
笑わん
笑おう
笑うまい
笑いたい
笑いたがる
笑いそうだ
笑うようだ
笑うらしい
笑っている
笑わなかった
笑った
笑いだった
笑いであった
笑ったとき
笑われた
笑えた
笑わせた
笑わさせた
笑いたかった
笑いたがった
笑いそうだった
笑うようだった
笑うらしかった
笑っていた
笑いません
笑いましょう
笑います
笑いです
笑いです
ｘ
ｘ
笑いなさい
笑いなさいよ
笑われます
笑えます
笑わせます
笑わさせます
笑いませぬ
笑いません
笑いましょう
笑いますまい
笑いたいです
笑いたがります
笑いそうです
笑うようです
笑うらしいです
笑っています
笑いませんでした
笑いました
笑いでした
笑いでした
ｘ
笑われました
笑えました
笑わせました
笑わさせました
笑いたかったです
笑いたがりました
笑いそうでした
笑うようでした
笑うらしかったです
笑っていました
";

            var sentences = text.Split(
                new[] { "\r\n", "\r", "\n" },
                StringSplitOptions.None
            ).Select((item, index) => new Sentence(item, index));
            List<List<TokenElement>> listlist = KuromojiController.Tokenize(sentences);

            foreach (var tokens in listlist)
            {
                StringBuilder sb = new StringBuilder();
                sb.Append(string.Join("", tokens.Select(i => i.Surface)));
                sb.Append('\t');

                List<string> tokenString = new List<string>();
                foreach (var token in tokens)
                {
                    tokenString.Add($"{token.Surface}({token.Reading})/{token.BaseForm}[{token.PartOfSpeech[0]}]{token.InflectionType}/{token.InflectionForm}");
                }

                sb.Append(string.Join(" - ", tokenString));
                sb.Append('\t');

                sb.Append(string.Join(" - ", tokens.Select(i => i.Surface)));
                sb.Append('\t');

                sb.Append(string.Join(" - ", tokens.Select(i => i.Surface).Reverse()));

                output.WriteLine(sb.ToString());
            }
        }
    }
}
